Revit 2027 API
BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromScaledLink Property
 Can't acquire coordinates from a link that is scaled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAcquireCoordinatesFromScaledLink { get; }
Public Shared ReadOnly Property CannotAcquireCoordinatesFromScaledLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAcquireCoordinatesFromScaledLink {
	FailureDefinitionId^ get ();
}
static member CannotAcquireCoordinatesFromScaledLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace